---
displayed_sidebar: "Japanese"
---

# add_months

## 説明

指定された日付（DATEまたはDATETIME）に指定された月数を追加します。[months_add](./months_add.md) 関数は類似の機能を提供します。

結果の月の日の部分は、`date`で指定された日と同じままです。ただし、結果の月の日の数が指定された日付の日の部分よりも少ない場合、その日は結果の月の最後の日になります。例えば、`select add_months('2022-01-31', 1);` は `2022-02-28 00:00:00` を返します。結果の月の日の数が指定された日付の日の部分よりも多い場合、結果は`date`と同じ日の部分を持ちます。例えば、`select add_months('2022-02-28', 1)` は `2022-03-28 00:00:00` を返します。

Oracleとの違い: Oracleでは、`date`が月の最後の日の場合、結果も結果の月の最後の日になります。

無効な日付またはNULLの引数が渡された場合、NULLが返されます。

## 構文

```Haskell
ADD_MONTH(date, months)
```

## パラメーター

- `date`: 有効な日付またはdatetime表現である必要があります。
- `months`: 追加したい月数です。整数である必要があります。 正の整数は`date`に月を追加します。 負の整数は`date`から月を引きます。

## 戻り値

DATETIME値を返します。例えば`2020-02-30`のような日付が存在しない場合、NULLが返されます。

日付がDATE値の場合、DATETIME値に変換されます。

## 例

```Plain Text
> select add_months('2022-01-01', 2);
+-----------------------------+
| add_months('2022-01-01', 2) |
+-----------------------------+
| 2022-03-01 00:00:00         |
+-----------------------------+

> select add_months('2022-01-01', -5);
+------------------------------+
| add_months('2022-01-01', -5) |
+------------------------------+
| 2021-08-01 00:00:00          |
+------------------------------+

> select add_months('2022-01-31', 1);
+-----------------------------+
| add_months('2022-01-31', 1) |
+-----------------------------+
| 2022-02-28 00:00:00         |
+-----------------------------+

> select add_months('2022-01-31 17:01:02', -2);
+---------------------------------------+
| add_months('2022-01-31 17:01:02', -2) |
+---------------------------------------+
| 2021-11-30 17:01:02                   |
+---------------------------------------+

> select add_months('2022-02-28', 1);
+-----------------------------+
| add_months('2022-02-28', 1) |
+-----------------------------+
| 2022-03-28 00:00:00         |
+-----------------------------+
```