---
displayed_sidebar: "Japanese"
---

# add_months

## 説明

指定された日付（DATEまたはDATETIME）に指定された月数を追加します。[months_add](./months_add.md) 関数は類似の機能を提供します。

結果の月の日の要素は、`date` で指定されたものと同じままです。ただし、結果の月の日の要素が指定された日付の日の要素よりも少ない場合、その日は結果の月の最終日になります。たとえば、 `select add_months('2022-01-31', 1);` は `2022-02-28 00:00:00` を返します。結果の月の日の要素が指定された日付の日の要素よりも多い場合、結果は `date` と同じ日の要素を持ちます。たとえば、 `select add_months('2022-02-28', 1)` は `2022-03-28 00:00:00` を返します。

Oracle との違い: Oracle では、`date` が月の最終日の場合、結果は結果の月の最終日になります。

無効な日付またはNULL引数が渡された場合、NULLを返します。

## 構文

```Haskell
ADD_MONTH(date, months)
```

## パラメーター

- `date`: 有効な日付または日時表現でなければなりません。
- `months`: 追加したい月数です。整数でなければなりません。正の整数は`date` に月を追加します。負の整数は`date` から月を引きます。

## 戻り値

DATETIME値を返します。例えば、`2020-02-30` のような日付が存在しない場合、NULLが返されます。

日付がDATE値の場合、DATETIME値に変換されます。

## 例

```Plain Text
> select add_months('2022-01-01', 2);
+-----------------------------+
| add_months('2022-01-01', 2) |
+-----------------------------+
| 2022-03-01 00:00:00         |
+-----------------------------+

> select add_months('2022-01-01', -5);
+------------------------------+
| add_months('2022-01-01', -5) |
+------------------------------+
| 2021-08-01 00:00:00          |
+------------------------------+

> select add_months('2022-01-31', 1);
+-----------------------------+
| add_months('2022-01-31', 1) |
+-----------------------------+
| 2022-02-28 00:00:00         |
+-----------------------------+

> select add_months('2022-01-31 17:01:02', -2);
+---------------------------------------+
| add_months('2022-01-31 17:01:02', -2) |
+---------------------------------------+
| 2021-11-30 17:01:02                   |
+---------------------------------------+

> select add_months('2022-02-28', 1);
+-----------------------------+
| add_months('2022-02-28', 1) |
+-----------------------------+
| 2022-03-28 00:00:00         |
+-----------------------------+
```